CoreTemplates/MRF/kEpsilon/wall-resolved/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    rotaryRegion
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    rotaryRegion_slave
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    propeller
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    nonConformalCyclic_on_rotaryRegion
    {
        type            nonConformalCyclic;
    }
    nonConformalCyclic_on_rotaryRegion_slave
    {
        type            nonConformalCyclic;
    }
    nonConformalError_on_rotaryRegion
    {
        type            nonConformalError;
    }
    nonConformalError_on_rotaryRegion_slave
    {
        type            nonConformalError;
    }
}


// ************************************************************************* //
